Бух_для_edt/src/InformationRegisters/смартНоменклатураКонтрагентовБЭД/смартНоменклатураКонтрагентовБЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартНоменклатураКонтрагентовБЭД</name>
  <comment>#5612 смарт: Тимофеева 24.06.2026 / Доработка или донастройка блока Диадок в БП в части входящих документов</comment>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>DefinedType.НоменклатураБЭД</types>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>DefinedType.ВладелецНоменклатурыБЭД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Бух_для_edt/src/InformationRegisters/смартНоменклатураКонтрагентовБЭД/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция НайтиНоменклатуруКонтрагентаПоЧастиНаименования(Владелец, СтрокаПоиска) Экспорт	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	смартНоменклатураКонтрагентовБЭД.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.смартНоменклатураКонтрагентовБЭД КАК смартНоменклатураКонтрагентовБЭД
	|ГДЕ
	|	смартНоменклатураКонтрагентовБЭД.Владелец = &Владелец
	|	И &СтрокаПоиска ПОДОБНО смартНоменклатураКонтрагентовБЭД.Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	смартНоменклатураКонтрагентовБЭД.Приоритет";	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("СтрокаПоиска", СтрокаПоиска);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Номенклатура;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

#КонецОбласти

#КонецЕсли
